<!DOCTYPE html>
<html lang="de">
<head>
  <meta charset="UTF-8">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <meta name="robots" content="noindex">
  <title>Datenschutzerkl&auml;rung | FOF Stats</title>
  <link rel="stylesheet" href="/css/style.css">
  <style>
    .legal-container { max-width: 800px; margin: 0 auto; padding: 32px 20px; }
    .legal-container h1 { color: var(--text-accent, #0f0); margin-bottom: 24px; }
    .legal-container h2 { color: var(--text-accent, #0f0); font-size: 1.1rem; margin: 24px 0 8px; border-bottom: 1px solid var(--border-color, #555); padding-bottom: 4px; }
    .legal-container p, .legal-container li { font-size: 0.9rem; line-height: 1.6; color: var(--text-secondary, #aaa); }
    .legal-container ul { padding-left: 20px; }
    .legal-container a { color: var(--text-accent, #0f0); }
    .legal-back { display: inline-block; margin-bottom: 20px; color: var(--text-accent, #0f0); text-decoration: none; }
    .legal-back:hover { text-decoration: underline; }
  </style>
</head>
<body>
  <div class="legal-container">
    <a href="/" class="legal-back">&larr; Zur&uuml;ck zum Dashboard</a>
    <h1>C:\&gt; DATENSCHUTZERKL&Auml;RUNG</h1>

    <h2>1. Verantwortlicher</h2>
    <p>
      Markus Keppel<br>
      Hauptstra&szlig;e 149<br>
      76872 Freckenfeld<br>
      E-Mail: mail@markus-keppel.de
    </p>

    <h2>2. Allgemeines zur Datenverarbeitung</h2>
    <p>
      Diese Website ist ein privates, nicht-kommerzielles Statistik-Dashboard f&uuml;r ein
      Folding@Home-Team. Es werden keine Cookies gesetzt, keine Tracking- oder Analysedienste
      verwendet und keine Benutzerkonten angeboten. Dennoch fallen beim Betrieb dieser Website
      personenbezogene Daten an, &uuml;ber deren Verarbeitung ich Sie im Folgenden informiere.
    </p>

    <h2>3. Bereitstellung der Website und Server-Logfiles</h2>
    <p>
      Beim Aufruf dieser Website werden durch den Hostinganbieter automatisch Informationen
      in sogenannten Server-Logfiles erfasst, die Ihr Browser automatisch &uuml;bermittelt.
      Dies umfasst:
    </p>
    <ul>
      <li>IP-Adresse des anfragenden Rechners</li>
      <li>Datum und Uhrzeit des Zugriffs</li>
      <li>Name und URL der abgerufenen Datei</li>
      <li>&Uuml;bertragene Datenmenge</li>
      <li>Browsertyp und Browserversion</li>
      <li>Verwendetes Betriebssystem</li>
      <li>Referrer-URL (die zuvor besuchte Seite)</li>
    </ul>
    <p>
      Diese Daten werden zur Sicherstellung eines st&ouml;rungsfreien Betriebs der Website
      sowie zur Erkennung und Abwehr von Angriffen erhoben. Eine Zusammenf&uuml;hrung dieser
      Daten mit anderen Datenquellen wird nicht vorgenommen.
    </p>
    <p>
      <strong>Rechtsgrundlage:</strong> Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse
      an der sicheren und stabilen Bereitstellung der Website).
    </p>
    <p>
      <strong>Speicherdauer:</strong> Die Server-Logfiles werden nach sp&auml;testens 7 Tagen
      automatisch gel&ouml;scht, sofern keine weitere Aufbewahrung zu Beweiszwecken erforderlich ist.
    </p>

    <h2>4. Content Delivery Network (CDN)</h2>
    <p>
      Diese Website nutzt das Content Delivery Network (CDN) von <strong>jsdelivr</strong>
      (betrieben von ProspectOne, Kr&oacute;lewska 65A/1, 30-081 Krak&oacute;w, Polen) zur
      Auslieferung von JavaScript-Bibliotheken. Beim Abruf dieser Inhalte wird eine Verbindung
      zu den Servern von jsdelivr hergestellt, wobei Ihre IP-Adresse an jsdelivr &uuml;bermittelt wird.
    </p>
    <p>
      <strong>Rechtsgrundlage:</strong> Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an
      einer effizienten und sicheren Auslieferung der Website). Die Datenverarbeitung erfolgt
      innerhalb der Europ&auml;ischen Union.
    </p>
    <p>
      Weitere Informationen finden Sie in der Datenschutzerkl&auml;rung von jsdelivr:
      <a href="https://www.jsdelivr.com/terms/privacy-policy-jsdelivr-net" target="_blank" rel="noopener noreferrer">https://www.jsdelivr.com/terms/privacy-policy-jsdelivr-net</a>
    </p>

    <h2>5. Anzeige von Folding@Home-Statistiken</h2>
    <p>
      Diese Website ruft &ouml;ffentlich zug&auml;ngliche Statistikdaten &uuml;ber die offizielle
      Folding@Home-API (api.foldingathome.org) ab und zeigt diese an. Dazu geh&ouml;ren
      insbesondere Benutzernamen (selbst gew&auml;hlte Pseudonyme), Punkte, Work Units und
      Teamzugeh&ouml;rigkeiten. Diese Daten werden von den jeweiligen Nutzern freiwillig bei
      Folding@Home ver&ouml;ffentlicht und sind &uuml;ber die offizielle API ohne
      Zugangsbeschr&auml;nkung abrufbar.
    </p>
    <p>
      <strong>Rechtsgrundlage:</strong> Art. 6 Abs. 1 lit. f DSGVO (berechtigtes Interesse an
      der Darstellung &ouml;ffentlich zug&auml;nglicher Teamstatistiken zur Information der Community).
    </p>
    <p>
      <strong>Datenquelle:</strong> Die Daten werden nicht bei den Betroffenen selbst erhoben,
      sondern aus der &ouml;ffentlich zug&auml;nglichen Folding@Home-API gem&auml;&szlig;
      Art. 14 DSGVO bezogen.
    </p>
    <p>
      <strong>Speicherdauer:</strong> Die abgerufenen Statistikdaten werden in einer lokalen
      Datenbank gespeichert und regelm&auml;&szlig;ig mit der API aktualisiert, um historische
      Verl&auml;ufe darstellen zu k&ouml;nnen.
    </p>

    <h2>6. Ihre Rechte als betroffene Person</h2>
    <p>Sie haben gegen&uuml;ber dem Verantwortlichen folgende Rechte hinsichtlich der Sie betreffenden personenbezogenen Daten:</p>
    <ul>
      <li><strong>Auskunftsrecht</strong> (Art. 15 DSGVO): Sie haben das Recht, Auskunft &uuml;ber die von uns verarbeiteten personenbezogenen Daten zu erhalten.</li>
      <li><strong>Recht auf Berichtigung</strong> (Art. 16 DSGVO): Sie haben das Recht, die Berichtigung unrichtiger Daten zu verlangen.</li>
      <li><strong>Recht auf L&ouml;schung</strong> (Art. 17 DSGVO): Sie haben das Recht, die L&ouml;schung Ihrer Daten zu verlangen, sofern die Voraussetzungen vorliegen.</li>
      <li><strong>Recht auf Einschr&auml;nkung der Verarbeitung</strong> (Art. 18 DSGVO): Sie haben das Recht, die Einschr&auml;nkung der Verarbeitung Ihrer Daten zu verlangen.</li>
      <li><strong>Recht auf Daten&uuml;bertragbarkeit</strong> (Art. 20 DSGVO): Sie haben das Recht, die Sie betreffenden Daten in einem strukturierten, g&auml;ngigen und maschinenlesbaren Format zu erhalten.</li>
      <li><strong>Widerspruchsrecht</strong> (Art. 21 DSGVO): Sie haben das Recht, aus Gr&uuml;nden, die sich aus Ihrer besonderen Situation ergeben, jederzeit gegen die Verarbeitung Ihrer personenbezogenen Daten, die auf Art. 6 Abs. 1 lit. f DSGVO beruht, Widerspruch einzulegen.</li>
    </ul>

    <h2>7. Beschwerderecht bei einer Aufsichtsbeh&ouml;rde</h2>
    <p>
      Sie haben das Recht, sich bei einer Datenschutz-Aufsichtsbeh&ouml;rde &uuml;ber die
      Verarbeitung Ihrer personenbezogenen Daten zu beschweren. Die f&uuml;r den Verantwortlichen
      zust&auml;ndige Aufsichtsbeh&ouml;rde ist:
    </p>
    <p>
      Der Landesbeauftragte f&uuml;r den Datenschutz und die Informationsfreiheit Rheinland-Pfalz<br>
      Hintere Bleiche 34<br>
      55116 Mainz<br>
      Telefon: +49 6131 8920-0<br>
      E-Mail: poststelle@datenschutz.rlp.de<br>
      Website: <a href="https://www.datenschutz.rlp.de" target="_blank" rel="noopener noreferrer">https://www.datenschutz.rlp.de</a>
    </p>

    <h2>8. &Auml;nderung dieser Datenschutzerkl&auml;rung</h2>
    <p>
      Diese Datenschutzerkl&auml;rung ist aktuell g&uuml;ltig und hat den Stand Februar 2026.
      Durch die Weiterentwicklung der Website oder aufgrund ge&auml;nderter gesetzlicher bzw.
      beh&ouml;rdlicher Vorgaben kann es notwendig werden, diese Datenschutzerkl&auml;rung zu &auml;ndern.
    </p>

    <p style="margin-top: 32px;">
      <a href="/" class="legal-back">&larr; Zur&uuml;ck zum Dashboard</a>
    </p>
  </div>
</body>
</html>
